thanks for the issue! however, the reproduction case you've provided works as expected for me.

```
$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_ruleset.cache_everything will be created
  + resource "cloudflare_ruleset" "cache_everything" {
      + description = (known after apply)
      + id          = (known after apply)
      + kind        = "zone"
      + name        = "Cache Everything"
      + phase       = "http_request_cache_settings"
      + zone_id     = "0da42c8d2132a9ddaf714f9e7c920711"

      + rules {
          + action       = "set_cache_settings"
          + description  = "Cache Everything"
          + enabled      = true
          + expression   = "true"
          + id           = (known after apply)
          + last_updated = (known after apply)
          + ref          = (known after apply)
          + version      = (known after apply)

          + action_parameters {
              + cache   = true
              + version = (known after apply)

              + edge_ttl {
                  + mode = "respect_origin"
                }

              + serve_stale {
                  + disable_stale_while_updating = false
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

cloudflare_ruleset.cache_everything: Creating...
cloudflare_ruleset.cache_everything: Creation complete after 2s [id=6814f0df637c43b5bd2372dbc68f47fb]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

have you manually modified your state file? have you made any other possibly impacting changes? have you attempted to jump back and forth between versions? if all else fails, you may need to remove the resource from your state file and reimport to get it working as it was.